paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupSale.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.saleslookup">
  <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
   	<urn:id>36C38912MN9658832</urn:id>
   	<urn:authorization>Bearer L8XmqR.Jp3ziVtzRTY0WEUfMpsE5Xw1qor2fGv51r.E</urn:authorization>
   </soapenv:Body>
</soapenv:Envelope>
